OLD/app/controllers/beats_controller.rb

SELECT "beats".* FROM "beats"
---
    def index
        @beats = Beat.all